load-results/breakdown-20260426-23/k6-mutations-mutation-20260426-231908-01-mutations.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

time="2026-04-26T23:19:08+10:00" level=warning msg="\"env\" level configuration overrode scenarios configuration entirely"
     execution: local
        script: k6-mutations.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 1 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  0m01.0s/5m0s

running (0m02.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m02.0s/5m0s

running (0m03.0s), 1/1 VUs, 57 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m03.0s/5m0s

running (0m04.0s), 1/1 VUs, 75 complete and 0 interrupted iterations
default   [   1% ] 1 VUs  0m04.0s/5m0s

running (0m05.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m05.0s/5m0s

running (0m06.0s), 1/1 VUs, 109 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m06.0s/5m0s

running (0m07.0s), 1/1 VUs, 126 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m07.0s/5m0s

running (0m08.0s), 1/1 VUs, 144 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m08.0s/5m0s

running (0m09.0s), 1/1 VUs, 166 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m09.0s/5m0s

running (0m10.0s), 1/1 VUs, 184 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m10.0s/5m0s

running (0m11.0s), 1/1 VUs, 204 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m11.0s/5m0s

running (0m12.0s), 1/1 VUs, 222 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m12.0s/5m0s

running (0m13.0s), 1/1 VUs, 242 complete and 0 interrupted iterations
default   [   4% ] 1 VUs  0m13.0s/5m0s

running (0m14.0s), 1/1 VUs, 261 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m14.0s/5m0s

running (0m15.0s), 1/1 VUs, 282 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m15.0s/5m0s

running (0m16.0s), 1/1 VUs, 303 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m16.0s/5m0s

running (0m17.0s), 1/1 VUs, 322 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m17.0s/5m0s

running (0m18.0s), 1/1 VUs, 341 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m18.0s/5m0s

running (0m19.0s), 1/1 VUs, 358 complete and 0 interrupted iterations
default   [   6% ] 1 VUs  0m19.0s/5m0s

running (0m20.0s), 1/1 VUs, 376 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m20.0s/5m0s

running (0m21.0s), 1/1 VUs, 394 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m21.0s/5m0s

running (0m22.0s), 1/1 VUs, 410 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m22.0s/5m0s

running (0m23.0s), 1/1 VUs, 430 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m23.0s/5m0s

running (0m24.0s), 1/1 VUs, 449 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m24.0s/5m0s

running (0m25.0s), 1/1 VUs, 469 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m25.0s/5m0s

running (0m26.0s), 1/1 VUs, 492 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m26.0s/5m0s

running (0m27.0s), 1/1 VUs, 511 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m27.0s/5m0s

running (0m28.0s), 1/1 VUs, 534 complete and 0 interrupted iterations
default   [   9% ] 1 VUs  0m28.0s/5m0s

running (0m29.0s), 1/1 VUs, 554 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m29.0s/5m0s

running (0m30.0s), 1/1 VUs, 572 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m30.0s/5m0s

running (0m31.0s), 1/1 VUs, 592 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m31.0s/5m0s

running (0m32.0s), 1/1 VUs, 610 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m32.0s/5m0s

running (0m33.0s), 1/1 VUs, 629 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m33.0s/5m0s

running (0m34.0s), 1/1 VUs, 652 complete and 0 interrupted iterations
default   [  11% ] 1 VUs  0m34.0s/5m0s

running (0m35.0s), 1/1 VUs, 670 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m35.0s/5m0s

running (0m36.0s), 1/1 VUs, 690 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m36.0s/5m0s

running (0m37.0s), 1/1 VUs, 708 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m37.0s/5m0s

running (0m38.0s), 1/1 VUs, 733 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m38.0s/5m0s

running (0m39.0s), 1/1 VUs, 750 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m39.0s/5m0s

running (0m40.0s), 1/1 VUs, 767 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m40.0s/5m0s

running (0m41.0s), 1/1 VUs, 787 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m41.0s/5m0s

running (0m42.0s), 1/1 VUs, 804 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m42.0s/5m0s

running (0m43.0s), 1/1 VUs, 819 complete and 0 interrupted iterations
default   [  14% ] 1 VUs  0m43.0s/5m0s

running (0m44.0s), 1/1 VUs, 835 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m44.0s/5m0s

running (0m45.0s), 1/1 VUs, 850 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m45.0s/5m0s

running (0m46.0s), 1/1 VUs, 869 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m46.0s/5m0s

running (0m47.0s), 1/1 VUs, 890 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m47.0s/5m0s

running (0m48.0s), 1/1 VUs, 908 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m48.0s/5m0s

running (0m49.0s), 1/1 VUs, 924 complete and 0 interrupted iterations
default   [  16% ] 1 VUs  0m49.0s/5m0s

running (0m50.0s), 1/1 VUs, 941 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m50.0s/5m0s

running (0m51.0s), 1/1 VUs, 962 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m51.0s/5m0s

running (0m52.0s), 1/1 VUs, 983 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m52.0s/5m0s

running (0m53.0s), 1/1 VUs, 1003 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m53.0s/5m0s

running (0m54.0s), 1/1 VUs, 1021 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m54.0s/5m0s

running (0m55.0s), 1/1 VUs, 1043 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m55.0s/5m0s

running (0m56.0s), 1/1 VUs, 1059 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m56.0s/5m0s

running (0m57.0s), 1/1 VUs, 1076 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m57.0s/5m0s

running (0m58.0s), 1/1 VUs, 1099 complete and 0 interrupted iterations
default   [  19% ] 1 VUs  0m58.0s/5m0s

running (0m59.0s), 1/1 VUs, 1117 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  0m59.0s/5m0s

running (1m00.0s), 1/1 VUs, 1135 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1m00.0s/5m0s

running (1m01.0s), 1/1 VUs, 1152 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1m01.0s/5m0s

running (1m02.0s), 1/1 VUs, 1169 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m02.0s/5m0s

running (1m03.0s), 1/1 VUs, 1186 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m03.0s/5m0s

running (1m04.0s), 1/1 VUs, 1205 complete and 0 interrupted iterations
default   [  21% ] 1 VUs  1m04.0s/5m0s

running (1m05.0s), 1/1 VUs, 1223 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m05.0s/5m0s

running (1m06.0s), 1/1 VUs, 1240 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m06.0s/5m0s

running (1m07.0s), 1/1 VUs, 1259 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  1m07.0s/5m0s

running (1m08.0s), 1/1 VUs, 1279 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m08.0s/5m0s

running (1m09.0s), 1/1 VUs, 1295 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m09.0s/5m0s

running (1m10.0s), 1/1 VUs, 1315 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  1m10.0s/5m0s

running (1m11.0s), 1/1 VUs, 1335 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m11.0s/5m0s

running (1m12.0s), 1/1 VUs, 1353 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m12.0s/5m0s

running (1m13.0s), 1/1 VUs, 1371 complete and 0 interrupted iterations
default   [  24% ] 1 VUs  1m13.0s/5m0s

running (1m14.0s), 1/1 VUs, 1386 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m14.0s/5m0s

running (1m15.0s), 1/1 VUs, 1408 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m15.0s/5m0s

running (1m16.0s), 1/1 VUs, 1431 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  1m16.0s/5m0s

running (1m17.0s), 1/1 VUs, 1450 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m17.0s/5m0s

running (1m18.0s), 1/1 VUs, 1468 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m18.0s/5m0s

running (1m19.0s), 1/1 VUs, 1485 complete and 0 interrupted iterations
default   [  26% ] 1 VUs  1m19.0s/5m0s

running (1m20.0s), 1/1 VUs, 1500 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m20.0s/5m0s

running (1m21.0s), 1/1 VUs, 1522 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m21.0s/5m0s

running (1m22.0s), 1/1 VUs, 1544 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  1m22.0s/5m0s

running (1m23.0s), 1/1 VUs, 1562 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m23.0s/5m0s

running (1m24.0s), 1/1 VUs, 1579 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m24.0s/5m0s

running (1m25.0s), 1/1 VUs, 1600 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  1m25.0s/5m0s

running (1m26.0s), 1/1 VUs, 1618 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m26.0s/5m0s

running (1m27.0s), 1/1 VUs, 1637 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m27.0s/5m0s

running (1m28.0s), 1/1 VUs, 1654 complete and 0 interrupted iterations
default   [  29% ] 1 VUs  1m28.0s/5m0s

running (1m29.0s), 1/1 VUs, 1672 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m29.0s/5m0s

running (1m30.0s), 1/1 VUs, 1692 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m30.0s/5m0s

running (1m31.0s), 1/1 VUs, 1708 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  1m31.0s/5m0s

running (1m32.0s), 1/1 VUs, 1729 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m32.0s/5m0s

running (1m33.0s), 1/1 VUs, 1749 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m33.0s/5m0s

running (1m34.0s), 1/1 VUs, 1768 complete and 0 interrupted iterations
default   [  31% ] 1 VUs  1m34.0s/5m0s

running (1m35.0s), 1/1 VUs, 1786 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m35.0s/5m0s

running (1m36.0s), 1/1 VUs, 1805 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m36.0s/5m0s

running (1m37.0s), 1/1 VUs, 1825 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  1m37.0s/5m0s

running (1m38.0s), 1/1 VUs, 1846 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m38.0s/5m0s

running (1m39.0s), 1/1 VUs, 1862 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m39.0s/5m0s

running (1m40.0s), 1/1 VUs, 1884 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  1m40.0s/5m0s

running (1m41.0s), 1/1 VUs, 1905 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m41.0s/5m0s

running (1m42.0s), 1/1 VUs, 1921 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m42.0s/5m0s

running (1m43.0s), 1/1 VUs, 1941 complete and 0 interrupted iterations
default   [  34% ] 1 VUs  1m43.0s/5m0s

running (1m44.0s), 1/1 VUs, 1959 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m44.0s/5m0s

running (1m45.0s), 1/1 VUs, 1978 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m45.0s/5m0s

running (1m46.0s), 1/1 VUs, 1999 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  1m46.0s/5m0s

running (1m47.0s), 1/1 VUs, 2017 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m47.0s/5m0s

running (1m48.0s), 1/1 VUs, 2034 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m48.0s/5m0s

running (1m49.0s), 1/1 VUs, 2051 complete and 0 interrupted iterations
default   [  36% ] 1 VUs  1m49.0s/5m0s

running (1m50.0s), 1/1 VUs, 2072 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m50.0s/5m0s

running (1m51.0s), 1/1 VUs, 2091 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m51.0s/5m0s

running (1m52.0s), 1/1 VUs, 2113 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  1m52.0s/5m0s

running (1m53.0s), 1/1 VUs, 2137 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m53.0s/5m0s

running (1m54.0s), 1/1 VUs, 2156 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m54.0s/5m0s

running (1m55.0s), 1/1 VUs, 2174 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  1m55.0s/5m0s

running (1m56.0s), 1/1 VUs, 2190 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m56.0s/5m0s

running (1m57.0s), 1/1 VUs, 2208 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m57.0s/5m0s

running (1m58.0s), 1/1 VUs, 2230 complete and 0 interrupted iterations
default   [  39% ] 1 VUs  1m58.0s/5m0s

running (1m59.0s), 1/1 VUs, 2246 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  1m59.0s/5m0s

running (2m00.0s), 1/1 VUs, 2263 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2m00.0s/5m0s

running (2m01.0s), 1/1 VUs, 2281 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2m01.0s/5m0s

running (2m02.0s), 1/1 VUs, 2302 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m02.0s/5m0s

running (2m03.0s), 1/1 VUs, 2325 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m03.0s/5m0s

running (2m04.0s), 1/1 VUs, 2346 complete and 0 interrupted iterations
default   [  41% ] 1 VUs  2m04.0s/5m0s

running (2m05.0s), 1/1 VUs, 2366 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m05.0s/5m0s

running (2m06.0s), 1/1 VUs, 2381 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m06.0s/5m0s

running (2m07.0s), 1/1 VUs, 2398 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  2m07.0s/5m0s

running (2m08.0s), 1/1 VUs, 2416 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m08.0s/5m0s

running (2m09.0s), 1/1 VUs, 2433 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m09.0s/5m0s

running (2m10.0s), 1/1 VUs, 2453 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  2m10.0s/5m0s

running (2m11.0s), 1/1 VUs, 2469 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m11.0s/5m0s

running (2m12.0s), 1/1 VUs, 2487 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m12.0s/5m0s

running (2m13.0s), 1/1 VUs, 2506 complete and 0 interrupted iterations
default   [  44% ] 1 VUs  2m13.0s/5m0s

running (2m14.0s), 1/1 VUs, 2524 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m14.0s/5m0s

running (2m15.0s), 1/1 VUs, 2543 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m15.0s/5m0s

running (2m16.0s), 1/1 VUs, 2566 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  2m16.0s/5m0s

running (2m17.0s), 1/1 VUs, 2583 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m17.0s/5m0s

running (2m18.0s), 1/1 VUs, 2602 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m18.0s/5m0s

running (2m19.0s), 1/1 VUs, 2618 complete and 0 interrupted iterations
default   [  46% ] 1 VUs  2m19.0s/5m0s

running (2m20.0s), 1/1 VUs, 2637 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m20.0s/5m0s

running (2m21.0s), 1/1 VUs, 2654 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m21.0s/5m0s

running (2m22.0s), 1/1 VUs, 2672 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  2m22.0s/5m0s

running (2m23.0s), 1/1 VUs, 2690 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m23.0s/5m0s

running (2m24.0s), 1/1 VUs, 2709 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m24.0s/5m0s

running (2m25.0s), 1/1 VUs, 2729 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  2m25.0s/5m0s

running (2m26.0s), 1/1 VUs, 2748 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m26.0s/5m0s

running (2m27.0s), 1/1 VUs, 2768 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m27.0s/5m0s

running (2m28.0s), 1/1 VUs, 2787 complete and 0 interrupted iterations
default   [  49% ] 1 VUs  2m28.0s/5m0s

running (2m29.0s), 1/1 VUs, 2804 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m29.0s/5m0s

running (2m30.0s), 1/1 VUs, 2824 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m30.0s/5m0s

running (2m31.0s), 1/1 VUs, 2844 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  2m31.0s/5m0s

running (2m32.0s), 1/1 VUs, 2863 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m32.0s/5m0s

running (2m33.0s), 1/1 VUs, 2884 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m33.0s/5m0s

running (2m34.0s), 1/1 VUs, 2902 complete and 0 interrupted iterations
default   [  51% ] 1 VUs  2m34.0s/5m0s

running (2m35.0s), 1/1 VUs, 2925 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m35.0s/5m0s

running (2m36.0s), 1/1 VUs, 2944 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m36.0s/5m0s

running (2m37.0s), 1/1 VUs, 2962 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  2m37.0s/5m0s

running (2m38.0s), 1/1 VUs, 2980 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m38.0s/5m0s

running (2m39.0s), 1/1 VUs, 3002 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m39.0s/5m0s

running (2m40.0s), 1/1 VUs, 3024 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  2m40.0s/5m0s

running (2m41.0s), 1/1 VUs, 3042 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m41.0s/5m0s

running (2m42.0s), 1/1 VUs, 3058 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m42.0s/5m0s

running (2m43.0s), 1/1 VUs, 3078 complete and 0 interrupted iterations
default   [  54% ] 1 VUs  2m43.0s/5m0s

running (2m44.0s), 1/1 VUs, 3099 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m44.0s/5m0s

running (2m45.0s), 1/1 VUs, 3117 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m45.0s/5m0s

running (2m46.0s), 1/1 VUs, 3135 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  2m46.0s/5m0s

running (2m47.0s), 1/1 VUs, 3156 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m47.0s/5m0s

running (2m48.0s), 1/1 VUs, 3172 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m48.0s/5m0s

running (2m49.0s), 1/1 VUs, 3190 complete and 0 interrupted iterations
default   [  56% ] 1 VUs  2m49.0s/5m0s

running (2m50.0s), 1/1 VUs, 3206 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m50.0s/5m0s

running (2m51.0s), 1/1 VUs, 3224 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m51.0s/5m0s

running (2m52.0s), 1/1 VUs, 3242 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  2m52.0s/5m0s

running (2m53.0s), 1/1 VUs, 3262 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m53.0s/5m0s

running (2m54.0s), 1/1 VUs, 3279 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m54.0s/5m0s

running (2m55.0s), 1/1 VUs, 3296 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  2m55.0s/5m0s

running (2m56.0s), 1/1 VUs, 3314 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m56.0s/5m0s

running (2m57.0s), 1/1 VUs, 3333 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m57.0s/5m0s

running (2m58.0s), 1/1 VUs, 3348 complete and 0 interrupted iterations
default   [  59% ] 1 VUs  2m58.0s/5m0s

running (2m59.0s), 1/1 VUs, 3364 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  2m59.0s/5m0s

running (3m00.0s), 1/1 VUs, 3384 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3m00.0s/5m0s

running (3m01.0s), 1/1 VUs, 3401 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3m01.0s/5m0s

running (3m02.0s), 1/1 VUs, 3421 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m02.0s/5m0s

running (3m03.0s), 1/1 VUs, 3441 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m03.0s/5m0s

running (3m04.0s), 1/1 VUs, 3456 complete and 0 interrupted iterations
default   [  61% ] 1 VUs  3m04.0s/5m0s

running (3m05.0s), 1/1 VUs, 3474 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m05.0s/5m0s

running (3m06.0s), 1/1 VUs, 3492 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m06.0s/5m0s

running (3m07.0s), 1/1 VUs, 3509 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  3m07.0s/5m0s

running (3m08.0s), 1/1 VUs, 3528 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m08.0s/5m0s

running (3m09.0s), 1/1 VUs, 3545 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m09.0s/5m0s

running (3m10.0s), 1/1 VUs, 3563 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  3m10.0s/5m0s

running (3m11.0s), 1/1 VUs, 3585 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m11.0s/5m0s

running (3m12.0s), 1/1 VUs, 3603 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m12.0s/5m0s

running (3m13.0s), 1/1 VUs, 3624 complete and 0 interrupted iterations
default   [  64% ] 1 VUs  3m13.0s/5m0s

running (3m14.0s), 1/1 VUs, 3643 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m14.0s/5m0s

running (3m15.0s), 1/1 VUs, 3662 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m15.0s/5m0s

running (3m16.0s), 1/1 VUs, 3679 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  3m16.0s/5m0s

running (3m17.0s), 1/1 VUs, 3696 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m17.0s/5m0s

running (3m18.0s), 1/1 VUs, 3717 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m18.0s/5m0s

running (3m19.0s), 1/1 VUs, 3737 complete and 0 interrupted iterations
default   [  66% ] 1 VUs  3m19.0s/5m0s

running (3m20.0s), 1/1 VUs, 3756 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m20.0s/5m0s

running (3m21.0s), 1/1 VUs, 3776 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m21.0s/5m0s

running (3m22.0s), 1/1 VUs, 3795 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  3m22.0s/5m0s

running (3m23.0s), 1/1 VUs, 3816 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m23.0s/5m0s

running (3m24.0s), 1/1 VUs, 3837 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m24.0s/5m0s

running (3m25.0s), 1/1 VUs, 3855 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  3m25.0s/5m0s

running (3m26.0s), 1/1 VUs, 3876 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m26.0s/5m0s

running (3m27.0s), 1/1 VUs, 3895 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m27.0s/5m0s

running (3m28.0s), 1/1 VUs, 3914 complete and 0 interrupted iterations
default   [  69% ] 1 VUs  3m28.0s/5m0s

running (3m29.0s), 1/1 VUs, 3931 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m29.0s/5m0s

running (3m30.0s), 1/1 VUs, 3949 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m30.0s/5m0s

running (3m31.0s), 1/1 VUs, 3968 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  3m31.0s/5m0s

running (3m32.0s), 1/1 VUs, 3991 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m32.0s/5m0s

running (3m33.0s), 1/1 VUs, 4013 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m33.0s/5m0s

running (3m34.0s), 1/1 VUs, 4030 complete and 0 interrupted iterations
default   [  71% ] 1 VUs  3m34.0s/5m0s

running (3m35.0s), 1/1 VUs, 4047 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m35.0s/5m0s

running (3m36.0s), 1/1 VUs, 4065 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m36.0s/5m0s

running (3m37.0s), 1/1 VUs, 4082 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  3m37.0s/5m0s

running (3m38.0s), 1/1 VUs, 4101 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m38.0s/5m0s

running (3m39.0s), 1/1 VUs, 4123 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m39.0s/5m0s

running (3m40.0s), 1/1 VUs, 4139 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  3m40.0s/5m0s

running (3m41.0s), 1/1 VUs, 4155 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m41.0s/5m0s

running (3m42.0s), 1/1 VUs, 4172 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m42.0s/5m0s

running (3m43.0s), 1/1 VUs, 4194 complete and 0 interrupted iterations
default   [  74% ] 1 VUs  3m43.0s/5m0s

running (3m44.0s), 1/1 VUs, 4213 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m44.0s/5m0s

running (3m45.0s), 1/1 VUs, 4231 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m45.0s/5m0s

running (3m46.0s), 1/1 VUs, 4247 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  3m46.0s/5m0s

running (3m47.0s), 1/1 VUs, 4265 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m47.0s/5m0s

running (3m48.0s), 1/1 VUs, 4286 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m48.0s/5m0s

running (3m49.0s), 1/1 VUs, 4307 complete and 0 interrupted iterations
default   [  76% ] 1 VUs  3m49.0s/5m0s

running (3m50.0s), 1/1 VUs, 4323 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m50.0s/5m0s

running (3m51.0s), 1/1 VUs, 4342 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m51.0s/5m0s

running (3m52.0s), 1/1 VUs, 4361 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  3m52.0s/5m0s

running (3m53.0s), 1/1 VUs, 4379 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m53.0s/5m0s

running (3m54.0s), 1/1 VUs, 4398 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m54.0s/5m0s

running (3m55.0s), 1/1 VUs, 4418 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  3m55.0s/5m0s

running (3m56.0s), 1/1 VUs, 4435 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m56.0s/5m0s

running (3m57.0s), 1/1 VUs, 4459 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m57.0s/5m0s

running (3m58.0s), 1/1 VUs, 4479 complete and 0 interrupted iterations
default   [  79% ] 1 VUs  3m58.0s/5m0s

running (3m59.0s), 1/1 VUs, 4498 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  3m59.0s/5m0s

running (4m00.0s), 1/1 VUs, 4517 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4m00.0s/5m0s

running (4m01.0s), 1/1 VUs, 4539 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4m01.0s/5m0s

running (4m02.0s), 1/1 VUs, 4555 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m02.0s/5m0s

running (4m03.0s), 1/1 VUs, 4571 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m03.0s/5m0s

running (4m04.0s), 1/1 VUs, 4592 complete and 0 interrupted iterations
default   [  81% ] 1 VUs  4m04.0s/5m0s

running (4m05.0s), 1/1 VUs, 4613 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m05.0s/5m0s

running (4m06.0s), 1/1 VUs, 4633 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m06.0s/5m0s

running (4m07.0s), 1/1 VUs, 4651 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  4m07.0s/5m0s

running (4m08.0s), 1/1 VUs, 4668 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m08.0s/5m0s

running (4m09.0s), 1/1 VUs, 4686 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m09.0s/5m0s

running (4m10.0s), 1/1 VUs, 4707 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  4m10.0s/5m0s

running (4m11.0s), 1/1 VUs, 4725 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m11.0s/5m0s

running (4m12.0s), 1/1 VUs, 4741 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m12.0s/5m0s

running (4m13.0s), 1/1 VUs, 4761 complete and 0 interrupted iterations
default   [  84% ] 1 VUs  4m13.0s/5m0s

running (4m14.0s), 1/1 VUs, 4779 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m14.0s/5m0s

running (4m15.0s), 1/1 VUs, 4797 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m15.0s/5m0s

running (4m16.0s), 1/1 VUs, 4817 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  4m16.0s/5m0s

running (4m17.0s), 1/1 VUs, 4835 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m17.0s/5m0s

running (4m18.0s), 1/1 VUs, 4853 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m18.0s/5m0s

running (4m19.0s), 1/1 VUs, 4873 complete and 0 interrupted iterations
default   [  86% ] 1 VUs  4m19.0s/5m0s

running (4m20.0s), 1/1 VUs, 4892 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m20.0s/5m0s

running (4m21.0s), 1/1 VUs, 4911 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m21.0s/5m0s

running (4m22.0s), 1/1 VUs, 4929 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  4m22.0s/5m0s

running (4m23.0s), 1/1 VUs, 4946 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m23.0s/5m0s

running (4m24.0s), 1/1 VUs, 4966 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m24.0s/5m0s

running (4m25.0s), 1/1 VUs, 4985 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  4m25.0s/5m0s

running (4m26.0s), 1/1 VUs, 5004 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m26.0s/5m0s

running (4m27.0s), 1/1 VUs, 5026 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m27.0s/5m0s

running (4m28.0s), 1/1 VUs, 5044 complete and 0 interrupted iterations
default   [  89% ] 1 VUs  4m28.0s/5m0s

running (4m29.0s), 1/1 VUs, 5063 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m29.0s/5m0s

running (4m30.0s), 1/1 VUs, 5082 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m30.0s/5m0s

running (4m31.0s), 1/1 VUs, 5102 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  4m31.0s/5m0s

running (4m32.0s), 1/1 VUs, 5119 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m32.0s/5m0s

running (4m33.0s), 1/1 VUs, 5139 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m33.0s/5m0s

running (4m34.0s), 1/1 VUs, 5158 complete and 0 interrupted iterations
default   [  91% ] 1 VUs  4m34.0s/5m0s

running (4m35.0s), 1/1 VUs, 5176 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m35.0s/5m0s

running (4m36.0s), 1/1 VUs, 5195 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m36.0s/5m0s

running (4m37.0s), 1/1 VUs, 5216 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  4m37.0s/5m0s

running (4m38.0s), 1/1 VUs, 5235 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m38.0s/5m0s

running (4m39.0s), 1/1 VUs, 5256 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m39.0s/5m0s

running (4m40.0s), 1/1 VUs, 5274 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  4m40.0s/5m0s

running (4m41.0s), 1/1 VUs, 5294 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m41.0s/5m0s

running (4m42.0s), 1/1 VUs, 5312 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m42.0s/5m0s

running (4m43.0s), 1/1 VUs, 5333 complete and 0 interrupted iterations
default   [  94% ] 1 VUs  4m43.0s/5m0s

running (4m44.0s), 1/1 VUs, 5355 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m44.0s/5m0s

running (4m45.0s), 1/1 VUs, 5378 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m45.0s/5m0s

running (4m46.0s), 1/1 VUs, 5395 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  4m46.0s/5m0s

running (4m47.0s), 1/1 VUs, 5416 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m47.0s/5m0s

running (4m48.0s), 1/1 VUs, 5441 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m48.0s/5m0s

running (4m49.0s), 1/1 VUs, 5460 complete and 0 interrupted iterations
default   [  96% ] 1 VUs  4m49.0s/5m0s

running (4m50.0s), 1/1 VUs, 5478 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m50.0s/5m0s

running (4m51.0s), 1/1 VUs, 5495 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m51.0s/5m0s

running (4m52.0s), 1/1 VUs, 5512 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  4m52.0s/5m0s

running (4m53.0s), 1/1 VUs, 5531 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m53.0s/5m0s

running (4m54.0s), 1/1 VUs, 5547 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m54.0s/5m0s

running (4m55.0s), 1/1 VUs, 5567 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  4m55.0s/5m0s

running (4m56.0s), 1/1 VUs, 5587 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m56.0s/5m0s

running (4m57.0s), 1/1 VUs, 5603 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m57.0s/5m0s

running (4m58.0s), 1/1 VUs, 5621 complete and 0 interrupted iterations
default   [  99% ] 1 VUs  4m58.0s/5m0s

running (4m59.0s), 1/1 VUs, 5644 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  4m59.0s/5m0s

running (5m00.0s), 1/1 VUs, 5661 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  5m00.0s/5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=10.32ms
    ✓ 'p(99)<3000' p(99)=14.02ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    mutation_checks
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......................: 22648   75.487559/s
    checks_succeeded...................: 100.00% 22648 out of 22648
    checks_failed......................: 0.00%   0 out of 22648

    ✓ insert status is 200
    ✓ insert response has id
    ✓ delete status is 200
    ✓ delete response is acknowledged

    CUSTOM
    delete_requests.........................................................: 5662    18.87189/s
    insert_requests.........................................................: 5662    18.87189/s
    inserted_image_id.......................................................: avg=581935   min=581935 med=581935  max=581935   p(90)=581935  p(95)=581935  
    mutation_checks.........................................................: 100.00% 11324 out of 11324
    mutation_http_time_ms...................................................: avg=5.811623 min=1.133  med=5.413   max=197.606  p(90)=8.7904  p(95)=10.32255
    mutation_requests.......................................................: 11324   37.74378/s

    HTTP
    http_req_duration.......................................................: avg=5.81ms   min=1.13ms med=5.41ms  max=197.6ms  p(90)=8.79ms  p(95)=10.32ms 
      { expected_response:true }............................................: avg=5.81ms   min=1.13ms med=5.41ms  max=197.6ms  p(90)=8.79ms  p(95)=10.32ms 
    http_req_failed.........................................................: 0.00%   0 out of 11324
    http_reqs...............................................................: 11324   37.74378/s

    EXECUTION
    iteration_duration......................................................: avg=52.97ms  min=5.11ms med=52.84ms max=257.73ms p(90)=85.93ms p(95)=90.18ms 
    iterations..............................................................: 5662    18.87189/s
    vus.....................................................................: 1       min=1              max=1
    vus_max.................................................................: 1       min=1              max=1

    NETWORK
    data_received...........................................................: 26 MB   88 kB/s
    data_sent...............................................................: 14 MB   45 kB/s



running (5m00.0s), 0/1 VUs, 5662 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  5m0s